### Unit2 실습 1

In [1]:
import pandas as pd

In [4]:
df= pd.DataFrame(
        {'a': [4,5,6],
        'b': [7,8,9],
        'c': [10,11,12]},
        index = [1,2,3])

In [5]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [7]:
df['a']

1    4
2    5
3    6
Name: a, dtype: int64

In [8]:
df['b']

1    7
2    8
3    9
Name: b, dtype: int64

In [9]:
df[['a','b']]

   a  b
1  4  7
2  5  8
3  6  9

In [10]:
df.loc[1]

a     4
b     7
c    10
Name: 1, dtype: int64

In [11]:
df.loc[3,'a']

6

In [12]:
df.loc[[1,2],['a','b']]

   a  b
1  4  7
2  5  8

In [14]:
df = pd.DataFrame(
    [[4,7,10],
    [5,8,11],
    [6,9,12]],
    index = [1,2,3],
    columns = ['a','b','c']
        )
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [16]:
import numpy as np

In [17]:
df= pd.DataFrame(
        {'a': [4,5,6,7,np.nan],
        'b': [7,8,np.nan, 9,9],
        'c': [10,11,12, np.nan,12]},
        index = pd.MultiIndex.from_tuples(
            [('d',1),('d',2),('e',2),('e',3),('e',4)],
        names=['n','v']))

In [18]:
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  7.0  9.0   NaN
  4  NaN  9.0  12.0